IDENTIFICATION DIVISION.
PROGRAM-ID. DATA-TEST.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 SOME-IDENT PIC 99(4)9 COMP VALUE 1234.
    01 SOME-OTHER-IDENT PIC S9(4)9(2) COMP VALUE -10293.
    01 HELLO-WORLD PIC X(11) VALUE "Hello World".

PROCEDURE DIVISION.
    DISPLAY "Hello world!".
    MOVE SOME-IDENT TO SOME-OTHER-IDENT.
    MOVE 10 TO SOME-IDENT.
    MOVE "Another Str" TO HELLO-WORLD.
STOP RUN.