IDENTIFICATION DIVISION.
PROGRAM-ID. INTRINSICS-TEST.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 INT-A PIC 9(4) COMP VALUE 40.
    01 INT-B PIC 9(4) COMP VALUE 7.
    01 OUT-INT PIC 9(4) COMP.

PROCEDURE DIVISION.
    MOVE FUNCTION MOD(INT-A, INT-B) TO OUT-INT.
    DISPLAY INT-A " % " INT-B " = " OUT-INT.
    STOP RUN.