IDENTIFICATION DIVISION.
PROGRAM-ID. DATA-TEST.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 SOME-IDENT PIC 99(4)V9.
    01 SOME-OTHER-IDENT PIC S9(4)9(2).

PROCEDURE DIVISION.
    DISPLAY "Hello world!\n".
    DISPLAY "Is this thing on?\n".
STOP RUN.